app/views/users/index.html.erb

            <td>
              <%= user.reservations.where(status: 'pending').count %>
---
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."user_id" = 1 AND "reservations"."status" = 'pending'

            <td>
              <%= user.loans.where(returned: false).count %>
---
SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = 2 AND "loans"."returned" = FALSE
SELECT COUNT(*) FROM "loans" WHERE "loans"."user_id" = 2 AND "loans"."returned" = FALSE

            <td>
              <%= user.loans.where(returned: false).map { |loan| loan.fine }.sum %>
---
SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = 2 AND "loans"."returned" = FALSE
SELECT SUM("fine") FROM "loans" WHERE "loans"."user_id" = 2 AND "loans"."returned" = FALSE