app/views/users/show.html.erb

  <h2 class="h5">Current Loans</h2>
  <% if @user.loans.any? %>
    <ul class="list-group">
      <% @user.loans.each do |loan| %>
---
SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = 1
SELECT 1 AS one FROM "loans" WHERE "loans"."user_id" = 1 LIMIT 1

  <h2 class="h5">Current Reservations</h2>
  <% if @user.reservations.any? %>
    <ul class="list-group">
      <% @user.reservations.each do |reservation| %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = 1
SELECT 1 AS one FROM "reservations" WHERE "reservations"."user_id" = 1 LIMIT 1