app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
  <%= form.text_field :search, placeholder: "Search by book title", class: "form-control", value: @query %>
  <%= form.select :category, options_for_select(Book.categories.keys.map { |category| [category.humanize, category] }, @current_category), {prompt: "Select a category"}, class: "form-select" %>