app/views/books/show.html.erb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."book_id" = 7 LIMIT 1
---
      <span class="text-danger">Not available</span>
      <% if @book.reservation.present? %>

SELECT "reservations".* FROM "reservations" WHERE "reservations"."book_id" = 1 LIMIT 1
---

<% if @book.reservation.present? %>