app/views/journals/index.html.erb

  <%= form.text_field :search, placeholder: "Search by title", class: "form-control", value: @query %>
  <%= form.select :category, options_for_select(Journal.categories.keys.map { |category| [category.humanize, category] }, @current_category), {prompt: "Choose a category"}, class: "form-select" %>
---
SELECT "journals".* FROM "journals"