app/views/journals/show.html.erb

      <span class="text-danger">Not available</span>
      <% if @journal.reservation.present? %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."journal_id" = 6 LIMIT 1