app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (title ILIKE '%alc%')
SELECT "books".* FROM "books" WHERE (title ILIKE '%alc%') AND "books"."category" = 'Fiction'
---
  def index
    @books = Book.all
    @books = @books.search(params[:search]) if params[:search].present?
    @books = @books.by_category(params[:category]) if params[:category].present?

INSERT INTO "reservations" ("user_id", "book_id", "journal_id", "expires_at", "status", "created_at", "updated_at") VALUES (1, 8, NULL, '2025-03-02 11:14:08.870726', 'pending', '2025-03-02 09:14:08.883340', '2025-03-02 09:14:08.883340') RETURNING "id"
---
  def reserve
    @book.reservation.destroy if @book.reservation&.reservation_expired?
    if @book.available? && current_user.reservations.create(book: @book, expires_at: 2.hours.from_now, status: 'pending')