app/controllers/journals_controller.rb

  def index
    @journals = Journal.all
    @journals = @journals.search(params[:search]) if params[:search].present?
    @journals = @journals.by_category(params[:category]) if params[:category].present?
---
SELECT "journals".* FROM "journals"
SELECT "journals".* FROM "journals" WHERE (title ILIKE '%dail%') AND "journals"."category" = 'Academic'

  def reserve
    @journal.reservation.destroy if @journal.reservation&.reservation_expired?
    if @journal.available? && current_user.reservations.create(journal: @journal, expires_at: 2.hours.from_now, status: 'pending')
---
INSERT INTO "reservations" ("user_id", "book_id", "journal_id", "expires_at", "status", "created_at", "updated_at") VALUES (2, NULL, 1, '2025-03-02 14:13:21.612709', 'pending', '2025-03-02 12:13:21.621538', '2025-03-02 12:13:21.621538') RETURNING "id"

  def set_journal
    @journal = Journal.find(params[:id])
---
SELECT "journals".* FROM "journals" WHERE "journals"."id" = 1 LIMIT 1