app/controllers/loans_controller.rb

SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = 1
---
  def index
    @loans = current_user.library_personnel? ? Loan.all : current_user.loans

SELECT "loans".* FROM "loans" WHERE "loans"."id" = 1 LIMIT 1
UPDATE "loans" SET "returned" = TRUE, "updated_at" = '2025-03-02 12:39:04.419462' WHERE "loans"."id" = 1
DELETE FROM "reservations" WHERE "reservations"."id" = 2
---
  def return
    @loan = Loan.find(params[:id])
    @loan.update(returned: true)
    @loan.book.reservation.destroy if @loan.book&.reservation
    @loan.journal.reservation.destroy if @loan.journal&.reservation