app/controllers/reservations_controller.rb

  def index
    @reservations = current_user.library_personnel? ? Reservation.all.where(status: 'pending') : current_user.reservations
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."status" = 'pending'

  def approve
    @reservation.update(status: 'approved')
    Loan.create(user: @reservation.user, book: @reservation.book, journal: @reservation.journal, due_date: 2.weeks.from_now)
---
UPDATE "reservations" SET "status" = 'approved', "updated_at" = '2025-03-02 09:17:00.902688' WHERE "reservations"."id" = 7
INSERT INTO "loans" ("user_id", "book_id", "journal_id", "due_date", "returned", "created_at", "updated_at") VALUES (1, 2, NULL, '2025-03-16 09:17:00.915879', FALSE, '2025-03-02 09:17:00.918505', '2025-03-02 09:17:00.918505') RETURNING "id"

  def reject
    @reservation.destroy
---
DELETE FROM "reservations" WHERE "reservations"."id" = 6